// 12.	Търговски комисионни
// Фирма дава следните комисионни на търговците си според града, в който работят и обема на продажбите:
// Град	0 ≤ s ≤ 500	500 < s ≤ 1 000	1 000 < s ≤ 10 000	s > 10 000
// Sofia	5%	7%	8%	12%
// Varna	4.5%	7.5%	10%	13%
// Plovdiv	5.5%	8%	12%	14.5%
// Напишете функция, която  получава име на град (стринг) и обем на продажби (число) и изчислява и извежда размера на търговската комисионна според горната таблица. Резултатът да се изведе форматиран до 2 цифри след десетичната точка. При невалиден град или обем на продажбите (отрицателно число) да се отпечата "error". 
// Примерен вход и изход
// вход	изход		вход	изход		вход	изход		вход	изход
// (["Sofia",
// "1500"])	120.00		(["Plovdiv",
// "499.99"])	27.50		(["Varna",
// "3874.50"])	387.45		(["Kaspichan",
// "-50"])	error

function tradeAgreement (input){


    let city = input[0];
    let salesvolume = Number(input[1]);
    let commision;

    switch (city){
        case : Sofia {
            commision = 5 %;
        }break;
        case: Varna {
            commision = 4.5%;
        }break;
        case: Plovdiv {
            commision = 5.5%;
        }break;
        default: ("error");
    }

}







tradeAgreement(["Sofia","1500"]);
